In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex1.csv")
dataset.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [3]:
dataset1 = pd.read_table("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv")
dataset1.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

## Trying to read TSV data using read_csv

In [4]:
#dataset2 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv")
# when i use the above line it reads the file as if it is a CSV hence we are not getting the data in good format
dataset2 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv",sep='\t')
#In the above line you can see that i have overidden the default delimeter saying sep = '\t'
dataset2

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

## I don't want my first row to be the header then use header = none

In [5]:
dataset3 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex2.csv",header = None)
dataset3

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

## To give your own column names for the datatset

In [6]:
dataset4 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex2.csv",names = ["one","two","three","four","five","six"])
dataset4

   one  two  three  four   five  six
0    1    2      3     4  hello  NaN
1    5    6      7     8  world  NaN
2    9   10     11    12    foo  NaN

## index_col just to make multilabel indexing

In [7]:
dataset5 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/csv_mindex.csv")
dataset5

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [8]:
multilabelindex = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/csv_mindex.csv",
                             index_col=['key1','key2'])
multilabelindex
## as you can see the below and above output the below one looks more clear and it is also easy to read

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

## Skip some of the rows because it doesn't make any sense about the data and looks bad

In [9]:
NotskippedRows = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex4.csv")
NotskippedRows

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [10]:
skippedRows = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex4.csv",skiprows=[0,2,3])
skippedRows
# we can see the above and below data and there is a lot of difference between both of them.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## This is to find where the null values are located in the dataset

In [11]:
normalData = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
normalData

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [12]:
df = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
pd.isnull(df)
## so in the below output we can see where there are null values in the dataset there the value will be true and 
# where the values are not null there it is false.

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

## how to read data from excel and how to get data from a particular sheet in excel workbook

In [13]:
df1 = pd.read_excel("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/Book1.xlsx")
df1
# here i am reading the whole excel data and it will get me the data in the first sheet

   a  b  c  d
0  1  3  5  7
1  2  4  6  8

In [14]:
# this code helps me to get only the data that is present in the second sheet
df2 = pd.read_excel("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/Book1.xlsx",sheet_name='example_sheet')
df2

   asdas  as   da asd as.1 da.1
0  asdas   s    s   s    s    s
1      s  ss  NaN   s    s    s

## reading the data using the URL's

In [15]:
pip install lxml

Requirement already satisfied: lxml in /Library/Frameworks/Python.framework/Versions/3.10/lib/python3.10/site-packages (4.9.2)
Note: you may need to restart the kernel to use updated packages.

In [22]:
url = 'https://en.wikipedia.org/wiki/List_of_countries_by_population_(United_Nations)'
df_list = pd.read_html(url)
# so whenever pandas reads a html url from the web it will take all the tables present in the url and make them into
# dataframes and it will combine all the dataframes into a list.
df4 = df_list[0]
df4.head()

,Country / Area,UN continental region[4],UN statistical subregion[4],Population (1 July 2022),Population (1 July 2023),Change
0,China[a],Asia,Eastern Asia,1425887337,1425671352,−0.02%
1,India,Asia,Southern Asia,1417173173,1428627663,+0.81%
2,United States,Americas,Northern America,338289857,339996564,+0.50%
3,Indonesia,Asia,South-eastern Asia,275501339,277534123,+0.74%
4,Pakistan,Asia,Southern Asia,235824863,240485658,+1.98%

## This code gets the name of all the columns

In [28]:
df4.columns

Index(['Country / Area', 'UN continental region[4]',
       'UN statistical subregion[4]', 'Population (1 July 2022)',
       'Population (1 July 2023)', 'Change'],
      dtype='object')

## This code is used to read a single column

In [27]:
df4['Country / Area']

0                               China[a]
1                                  India
2                          United States
3                              Indonesia
4                               Pakistan
                     ...
232          Montserrat (United Kingdom)
233    Falkland Islands (United Kingdom)
234                                 Niue
235                Tokelau (New Zealand)
236                                World
Name: Country / Area, Length: 237, dtype: object

## This code is used to read multiple columns at a time

In [25]:
df4[['Country / Area','UN continental region[4]']]

                        Country / Area UN continental region[4]
0                             China[a]                     Asia
1                                India                     Asia
2                        United States                 Americas
3                            Indonesia                     Asia
4                             Pakistan                     Asia
..                                 ...                      ...
232        Montserrat (United Kingdom)                 Americas
233  Falkland Islands (United Kingdom)                 Americas
234                               Niue                  Oceania
235              Tokelau (New Zealand)                  Oceania
236                              World                      NaN

[237 rows x 2 columns]

## Getting the dataset from a github

In [31]:
titanic_dataset = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')
titanic_dataset.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [32]:
titanic_dataset[['Name','Pclass']].head(10)

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3
5                                   Moran, Mr. James       3
6                            McCarthy, Mr. Timothy J       1
7                     Palsson, Master. Gosta Leonard       3
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)       3
9                Nasser, Mrs. Nicholas (Adele Achem)       2

In [33]:
titanic_dataset.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

## Exercise git dataset to a dataframe

In [35]:
dataframe_ex = pd.read_csv("https://raw.githubusercontent.com/akhil12028/Bank-Marketing-data-set-analysis/master/bank-additional-full.csv",sep=';')
dataframe_ex.head(5)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [43]:
## skip random rows
dataframe_ex1 = pd.read_csv("https://raw.githubusercontent.com/akhil12028/Bank-Marketing-data-set-analysis/master/bank-additional-full.csv",sep=';',skiprows=[1,2,4])
dataframe_ex1.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,45,services,married,basic.9y,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,59,admin.,married,professional.course,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,41,blue-collar,married,unknown,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [44]:
## print first 5 data points
dataframe_ex.head()

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no

In [45]:
## print last 2 data points
dataframe_ex.tail(2)

,age,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

In [55]:
## give your own column name
## here i am trying to change the column name
dataframe_ex.rename(columns={'age':'age1'})

,age1,job,marital,education,default,housing,loan,contact,month,day_of_week,...,campaign,pdays,previous,poutcome,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y
0,56,housemaid,married,basic.4y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
1,57,services,married,high.school,unknown,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
2,37,services,married,high.school,no,yes,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
3,40,admin.,married,basic.6y,no,no,no,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
4,56,services,married,high.school,no,no,yes,telephone,may,mon,...,1,999,0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41184,46,blue-collar,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41185,56,retired,married,university.degree,no,yes,no,cellular,nov,fri,...,2,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,no
41186,44,technician,married,professional.course,no,no,no,cellular,nov,fri,...,1,999,0,nonexistent,-1.1,94.767,-50.8,1.028,4963.6,yes
41187,74,retired,married,professional.course,no,yes,no,cellular,nov,fri,...,3,999,1,failure,-1.1,94.767,-50.8,1.028,4963.6,no

In [56]:
##select one columns and prints its data type
type(dataframe_ex['job'])

pandas.core.series.Series

In [57]:
## print dataframe datatypes
dataframe_ex.dtypes

age                 int64
job                object
marital            object
education          object
default            object
housing            object
loan               object
contact            object
month              object
day_of_week        object
duration            int64
campaign            int64
pdays               int64
previous            int64
poutcome           object
emp.var.rate      float64
cons.price.idx    float64
cons.conf.idx     float64
euribor3m         float64
nr.employed       float64
y                  object
dtype: object

In [58]:
## check data if anything is null
dataframe_ex.isnull().sum()
## This code is giving me how null values are present in each columns.

age               0
job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           0
month             0
day_of_week       0
duration          0
campaign          0
pdays             0
previous          0
poutcome          0
emp.var.rate      0
cons.price.idx    0
cons.conf.idx     0
euribor3m         0
nr.employed       0
y                 0
dtype: int64

In [61]:
df3 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex6.csv")
df3.head()

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

## This is used to Limit the number of rows that can be printed

In [67]:
df3 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex6.csv",nrows=5)
df3.head(20)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

## Chunk Size
### so when ever you are using a chunk size that means it will only read that particular mb datasize only lets consider an example:-
#### I have 4 rows of data and each row size is 30mb and i give chunk size as 100 then it will only read the first 4 rows completely and then it will read the 4th row partially and this one of the biggest problem using the chunk file.
#### And when we use chunk size it will store the data into a text and you have to iterate through it the file to get the data.

In [70]:
chunk = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex6.csv",chunksize=1000)
chunk

## Write operations
### These operations are used to write a csv file

In [72]:
df5 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
df5

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [73]:
df5.to_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5_out.csv")

## Store the out in output1.csv and they must be separated by @

In [74]:
df5.to_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/output1.csv",sep='@')

## copy to clipboard using the sys package

In [75]:
import sys
df6 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
df6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

## we can see in the above dataframe that there are values that are null now to we should replace them using something called as na_rep

In [76]:
df6.to_csv(sys.stdout,na_rep='Null')

,something,a,b,c,d,message
0,one,1,2,3.0,4,Null
1,two,5,6,Null,8,world
2,three,9,10,11.0,12,foo

### writing to a file without gettting the index and header values inside it

In [77]:
df6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [78]:
df6.to_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/outputNoindex_headers.csv",index=False,
          header=False)